cpeniche/embedded/driver_controller/stm32g431/platform/zephyr/app/src/buttons.cpp

#include <zephyr/logging/log.h>
LOG_MODULE_REGISTER(button, LOG_LEVEL_DBG);
#include <zephyr/kernel.h>
#include <zephyr/device.h>
#include <zephyr/drivers/uart.h>
#include <zephyr/drivers/adc.h>
#include <zephyr/drivers/spi.h>
#include "spiBuilder.h"
#include "zephyrSpi.h"
#include "can.h"
#include "motorInterface.h"
#include "motorBuilder.h"
#include "tle94103.h"
#include "drv8838.h"
#include "vnh5019a.h"
#include "inputInterface.h"
#include "inputBuilder.h"
#include "lin.h"
#include "adc.h"
#include "buttons.h"

#define STACK_SIZE 1024
#define PRIORITY K_PRIO_PREEMPT(15)

#define CALL_MEMBER_FN(object, ptrToMember) ((object)->*(ptrToMember))

static void DriverModuleTask(void);
/* Thread definitions*/
K_THREAD_DEFINE(DriverModule, STACK_SIZE, DriverModuleTask, NULL, NULL, NULL,
                PRIORITY, 0, 0);

int16_t error;

void linCallBack(const struct device *dev, struct uart_event *evt, void *user_data);

Buttons cButtons;

void Buttons::Task(void)
{

  uint8_t *rxBufferPtr;
  struct data *motorStructsPtr[4] = {&stWindow, &stMirror, &stLock, nullptr};
  struct data *motorData = nullptr;
  uint8_t idx, idy = 0;
  inputInterface *input = linButtonsReader.factoryMethod(device, rxBuffer, sizeof(rxBuffer), 0x10, linCallBack);
  inputInterface *adcinput = adcButtonsReader.factoryMethod(nullptr, nullptr, 0, 0, nullptr);

  while (1)
  {

    // if (Read(NULL, 2) == 0)
    if (input->readInput(nullptr, 2) == 0)
    {

      adcinput->readInput(nullptr, 0);
      k_sleep(K_MSEC(2000));
      /* wait for data */
      // if (getDataReady())
      if (input->getDataReady())
      {
        rxBufferPtr = input->getInput(); //   getData();

        if (rxBufferPtr[1] == maskMIRRORSELECTRIGHT)
          *stMirror.stActions[0x0].side = RIGHT;
        if (rxBufferPtr[1] == maskMIRRORSELECTLEFT)
          *stMirror.stActions[0x0].side = LEFT;

        /*Loop through all motor structure data*/
        idy = 0;
        while (motorStructsPtr[idy] != nullptr)
        {
          motorData = motorStructsPtr[idy];
          if (rxBufferPtr[motorData->u8BufferIndex] ^ motorData->u8PrevState)
          {
            idx = 0;
            while (motorData->stActions[idx].motor != nullptr)
            {
              if ((motorData->stActions[idx].mask &
                   rxBufferPtr[motorData->u8BufferIndex]) ==
                  motorData->stActions[idx].mask)
              {
                CALL_MEMBER_FN(motorData->motorClassPtr,
                               motorData->stActions[idx].motor)(*motorData->stActions[idx].side);
                break;
              }
              idx++;
            }
          }
          motorData->u8PrevState = rxBufferPtr[motorData->u8BufferIndex];
          idy++;
        }
      }
    }
  }
}

void DriverModuleTask()
{

  cButtons.Task();
}

void linCallBack(const struct device *dev, struct uart_event *evt, void *user_data)
{
  cButtons.getDriver()->callBack(dev, evt, user_data);
}
